def  get_matrix(n, m, value): #Функция прим. 3 параметра n=кол-вао строк m= кол-во столбцов value= значение
    matrix = [] #Внутри функиции создается список для хранения строк матрицы

    for i in range(n): #Внешний цикл для n строк
        row = [] #Создаем пустой список, который представялет одну строку матрицы
        for j in range(m): #Внутренний цикл отвечает ща добавление m значений в текущую строку row
            row.append(value) #После завершения внутреннего цикла, добавляем значения value в строку
        matrix.append(row) #Добавляем заполненную строку в матрицу


    return matrix #После завершения внешнего цикла функция возвращает созданную матрицу
#Вложенный список - это строка матрицы, элементы вложенных списков(глубже) - это столбцы матрицы.
#В случае передачи аргумента со значением 0 или меньше, будет возвращаться пустой список.
result1 = get_matrix(2, 2, 10)
result2 = get_matrix(3, 5, 42)
result3 = get_matrix(4, 2, 13)
print(result1)
print(result2)
print(result3)
