import random #Для генерации случайных чисел
result1 = random.randint (3, 20)
print(result1) #Для вывода сгенерированного числа

password = "" #Пустая строка для хранения пароля

for result2 in range(1, 20): #Внешний цикл Перебор от 1 до 19
    for result3 in range(result2 + 1, 20): #Внутренний цикл Для избежания повторяющихся пар
        if result1 % (result2 + result3) == 0: #Проверка условия
            password += str(result2) + str(result3) #Если условия верны, к строке добавляются значения res2 и res3, для уникальности

print(password) #Вывод пароля состоящий из всех пар res2 и res3, которые

#Все пароли для чисел от 3 до 20 (для сверки):
#3 - 12 1+2
#4 - 13 1+3
#5 - 1423 1+4 2+3
#6 - 121524 1+2 1+5 2+4
#7 - 162534 1+6 2+5 3+4
#8 - 13172635 1+3 1+7 2+6 3+5
#9 - 1218273645 и т.д.
#10 - 141923283746
#11 - 11029384756
#12 - 12131511124210394857
#13 - 112211310495867
#14 - 1611325212343114105968
#15 - 1214114232133124115106978
#16 - 1317115262143531341251161079
#17 - 11621531441351261171089
#19 - 118217316415514613712811910
#20 - 13141911923282183731746416515614713812911


